<img src="https://raw.githubusercontent.com/AmsterdamUMC/AmsterdamUMCdb/master/img/logo_amds.png" alt="Logo" style="width: 128px;"/>

# AmsterdamUMCdb Dictionaries

Copyright &copy; 2003-2020 Amsterdam UMC - Amsterdam Medical Data Science

# Dictionaries
Creates lists of all available parameters. Especially useful in the data exploration phase. The Dutch version of [SNOMED CT](https://browser.ihtsdotools.org/) can be used as a starting point for (official) translations to English medical terms.

**To do**: mapping with [SNOMED CT](https://browser.ihtsdotools.org/), [LOINC](https://search.loinc.org/searchLOINC/), etc.

## Imports

In [1]:
%matplotlib inline
import psycopg2
import pandas as pd
import numpy as np
import re

import matplotlib.pyplot as plt
import matplotlib.gridspec as gridspec
import matplotlib as mpl

import io
from IPython.display import display, HTML, Markdown

## Display settings

In [2]:
#matplotlib settings for image size
#needs to be in a different cell from %matplotlib inline
plt.style.use('seaborn-darkgrid')
plt.rcParams["figure.dpi"] = 288
plt.rcParams["figure.figsize"] = [16, 12]
plt.rcParams["font.size"] = 12

pd.options.display.max_columns = None
pd.options.display.max_rows = None
pd.options.display.max_colwidth = 1000

## Connection settings

In [3]:
#Modify config.ini in the root folder of the repository to change the settings to connect to your postgreSQL database
import configparser
import os
config = configparser.ConfigParser()

if os.path.isfile('../config.ini'):
    config.read('../config.ini')
else:
    config.read('../config.SAMPLE.ini')

#Open a connection to the postgres database:
con = psycopg2.connect(database=config['psycopg2']['database'], 
                       user=config['psycopg2']['username'], password=config['psycopg2']['password'], 
                       host=config['psycopg2']['host'], port=config['psycopg2']['port'])
con.set_client_encoding('WIN1252') #Uses code page for Dutch accented characters.
con.set_session(autocommit=True)

cursor = con.cursor()
cursor.execute('SET SCHEMA \'amsterdamumcdb\''); #set search_path to amsterdamumcdb schema

## drugitems
- itemid
- item
- ordercategoryid
- ordercategory

In [4]:
sql_drugitems_itemids = """
SELECT DISTINCT itemid, item, ordercategoryid, ordercategory
FROM drugitems
"""
drugitems_itemids = pd.read_sql(sql_drugitems_itemids,con)
drugitems_itemids.head()

,itemid,item,ordercategoryid,ordercategory
0,6799,Abciximab (Reopro),25,Injecties Haematologisch
1,6799,Abciximab (Reopro),65,2. Spuitpompen
2,6802,Acenocoumarol (Sintrom mitis),32,Niet iv Overig
3,6804,Acetazolamide (Diamox),24,Injecties Circulatie/Diuretica
4,6804,Acetazolamide (Diamox),27,Injecties Overig

In [5]:
drugitems_itemids.to_csv('drugitems_itemids.csv', index=False)

## freetextitems
- itemid
- itemids

In [6]:
sql_freetextitems_itemids = """
SELECT DISTINCT itemid, item
FROM freetextitems
"""
freetextitems_itemids = pd.read_sql(sql_freetextitems_itemids,con)
freetextitems_itemids.head()

   itemid                        item
0   14220      PORF-typ (verz. urine)
1   17663  Oxalaat kristallen (urine)
2   17939   Volgnummer MoDiag (bloed)
3   17368    HSV DNA PCR (blaasjesv.)
4   15694          JAK2 V617F (bloed)

In [7]:
freetextitems_itemids.to_csv('freetextitems_itemids.csv', index=False)

## listitems
- itemid
- item
- value
- valueid

In [8]:
sql_listitems_itemids = """
SELECT DISTINCT itemid, item, valueid, value 
FROM listitems
"""            
listitems_itemids = pd.read_sql(sql_listitems_itemids,con)
listitems_itemids.head()

   itemid             item  valueid value
0    6658  IABP Frequentie        1   1:1
1    6658  IABP Frequentie        2   1:2
2    6658  IABP Frequentie        3   1:3
3    6658  IABP Frequentie        4   Uit
4    6671        Hartritme        1   NSR

In [9]:
listitems_itemids.to_csv('listitems_itemids.csv', index=False)

## numericitems
- itemid
- item
- unitid
- unit

In [10]:
sql_numericitems_itemids = """
SELECT DISTINCT itemid, item, unitid, unit 
FROM numericitems
"""
numericitems_itemids = pd.read_sql(sql_numericitems_itemids,con)
numericitems_itemids.head()

   itemid            item  unitid  unit
0    6637  Opname gewicht      12    kg
1    6638  Huidig gewicht      12    kg
2    6640  Hartfrequentie      15  /min
3    6641  ABP systolisch     173  mmHg
4    6642   ABP gemiddeld     173  mmHg

In [11]:
numericitems_itemids.to_csv('numericitems_itemids.csv', index=False)

## procedureorderitems
- itemid
- item
- ordercategoryid
- ordercategoryname

In [12]:
sql_procedureorderitems_itemids = """
SELECT DISTINCT itemid, item, ordercategoryid, ordercategoryname
FROM procedureorderitems
ORDER BY itemid
"""
procedureorderitems_itemids = pd.read_sql(sql_procedureorderitems_itemids,con)
procedureorderitems_itemids.head()

   itemid                  item  ordercategoryid ordercategoryname
0    7921                   ECG               81  Opdr. Circulatie
1    7922              X-Thorax               82  Opdr. Respiratie
2    7922              X-Thorax              103  Opdr. Radiologie
3    7928             Uitzuigen               82  Opdr. Respiratie
4    7949  Filter CVVH wisselen              105        Opdr. CVVH

In [13]:
procedureorderitems_itemids.to_csv('procedureorderitems_itemids.csv', index=False)

## processitems
- itemid
- item

In [14]:
sql_processitems_itemids = """
SELECT DISTINCT itemid, item
FROM processitems
ORDER BY itemid
"""
processitems_itemids = pd.read_sql(sql_processitems_itemids,con)
processitems_itemids.head()

   itemid                   item
0    7926            Mobiliseren
1    7927            Buikligging
2    9159   Arterielijn Radialis
3    9160  Arterielijn Femoralis
4    9161  Dialyselijn Femoralis

In [15]:
processitems_itemids.to_csv('processitems_itemids.csv', index=False)